Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: ومن أظلم ممن افترى على الله كذبا أولئك يعرضون على ربهم ويقول الأشهاد هؤلاء الذين كذبوا على ربهم ألا لعنة الله على الظالمين
en: Who doeth greater wrong than he who inventeth a lie concerning Allah? Such will be brought before their Lord, and the witnesses will say: These are they who lied concerning their Lord. Now the curse of Allah is upon wrong-doers,

source: الذين يصدون عن سبيل الله ويبغونها عوجا وهم بالآخرة هم كافرون
en: Who debar (men) from the way of Allah and would have it crooked, and who are disbelievers in the Hereafter.

source: أولئك لم يكونوا معجزين في الأرض وما كان لهم من دون الله من أولياء يضاعف لهم العذاب ما كانوا يستطيعون السمع وما كانوا يبصرون
en: Such will not escape in the earth, nor have they any protecting friends beside Allah. For them the torment will be double. They could not bear to hear, and they used not to see.

source: أولئك الذين خسروا أنفسهم وضل عنهم ما كانوا يفترون
en: Such are they who have lost their souls, and that which they used to invent hath failed them.

source: لا جرم أنهم في الآخرة هم الأخسرون
en: Assuredly in the Hereafter they will be the greatest losers.

source: إن الذين آمنوا وعملوا الصالحات وأخبتوا إلى ربهم أولئك أصحاب الجنة هم فيها خالدون
en: Lo! those who believe and do good works and humble themselves before their Lord: such are rightful owners of the Garden; they will abide therein.

source: مثل الفريقين كالأعمى والأصم والبصير والسميع هل يستويان مثلا أفلا تذكرون
en: The similitude of the two parties is as the blind and the deaf and the seer and the hearer. Are they equal in similitude? Will ye not then be admonished?

source: ولقد أرسلنا نوحا إلى قومه إني لكم نذير مبين
en: And We sent Noah unto his folk (and he said): Lo! I am a plain warner unto you.

source: أن لا تعبدوا إلا الله إني أخاف عليكم عذاب يوم أليم
en: That ye serve none, save Allah. Lo! I fear for you the retribution of a painful Day.

source: فقال الملأ الذين كفروا من قومه ما نراك إلا بشرا مثلنا وما نراك اتبعك إلا الذين هم أراذلنا بادي الرأي وما نرى لكم علينا من فضل بل نظنكم كاذبين
en: The chieftains of his folk, who disbelieved, said: We see thee but a mortal like us, and we see not that any follow thee save the most abject among us, without reflection. We behold in you no merit above us - nay, we deem you liars.

source: قال يا قوم أرأيتم إن كنت على بينة من ربي وآتاني رحمة من عنده فعميت عليكم أنلزمكموها وأنتم لها كارهون
en: He said: O my people! Bethink you, if I rely on a clear proof from my Lord and there hath come unto me a mercy from His presence, and it hath been made obscure to you, can we compel you to accept it when ye are averse thereto?

source: ويا قوم لا أسألكم عليه مالا إن أجري إلا على الله وما أنا بطارد الذين آمنوا إنهم ملاقو ربهم ولكني أراكم قوما تجهلون
en: And O my people! I ask of you no wealth therefor. My reward is the concern only of Allah, and I am not going to thrust away those who believe - Lo! they have to meet their Lord! - but I see you a folk that are ignorant.

source: ويا قوم من ينصرني من الله إن طردتهم أفلا تذكرون
en: And, O my people! who would deliver me from Allah if I thrust them away? Will ye not then reflect?

source: ولا أقول لكم عندي خزائن الله ولا أعلم الغيب ولا أقول إني ملك ولا أقول للذين تزدري أعينكم لن يؤتيهم الله خيرا الله أعلم بما في أنفسهم إني إذا لمن الظالمين
en: I say not unto you: "I have the treasures of Allah" nor "I have knowledge of the Unseen," nor say I: "Lo! I am an angel!" Nor say I unto those whom your eyes scorn that Allah will not give them good - Allah knoweth best what is in their hearts - Lo! then indeed I should be of the wrong-doers.

source: قالوا يا نوح قد جادلتنا فأكثرت جدالنا فأتنا بما تعدنا إن كنت من الصادقين
en: They said: O Noah! Thou hast disputed with us and multiplied disputation with us; now bring upon us that wherewith thou threatenest us, if thou art of the truthful.

source: قال إنما يأتيكم به الله إن شاء وما أنتم بمعجزين
en: He said: Only Allah will bring it upon you if He will, and ye can by no means escape.

source: ولا ينفعكم نصحي إن أردت أن أنصح لكم إن كان الله يريد أن يغويكم هو ربكم وإليه ترجعون
en: My counsel will not profit you if I were minded to advise you, if Allah's will is to keep you astray. He is your Lord and unto Him ye will be brought back.

source: أم يقولون افتراه قل إن افتريته فعلي إجرامي وأنا بريء مما تجرمون
en: Or say they (again): He hath invented it? Say: If I have invented it, upon me be my crimes, but I am innocent of (all) that ye commit.

source: وأوحي إلى نوح أنه لن يؤمن من قومك إلا من قد آمن فلا تبتئس بما كانوا يفعلون
en: And it was inspired in Noah, (saying): No-one of thy folk will believe save him who hath believed already. Be not distressed because of what they do.

source: واصنع الفلك بأعيننا ووحينا ولا تخاطبني في الذين ظلموا إنهم مغرقون
en: Build the ship under Our eyes and by Our inspiration, and speak not unto Me on behalf of those who do wrong. Lo! they will be drowned.

source: ويصنع الفلك وكلما مر عليه ملأ من قومه سخروا منه قال إن تسخروا منا فإنا نسخر منكم كما تسخرون
en: And he was building the ship, and every time that chieftains of his people passed him, they made mock of him. He said: Though ye make mock of Us, yet We mock at you even as ye mock;

source: فسوف تعلمون من يأتيه عذاب يخزيه ويحل عليه عذاب مقيم
en: And ye shall know to whom a punishment that will confound him cometh, and upon whom a lasting doom will fall.

source: حتى إذا جاء أمرنا وفار التنور قلنا احمل فيها من كل زوجين اثنين وأهلك إلا من سبق عليه القول ومن آمن وما آمن معه إلا قليل
en: (Thus it was) till, when Our commandment came to pass and the oven gushed forth water, We said: Load therein two of every kind, a pair (the male and female), and thy household, save him against whom the word hath gone forth already, and those who believe. And but a few were they who believed with him.

source: وقال اركبوا فيها بسم الله مجراها ومرساها إن ربي لغفور رحيم
en: And he said: Embark therein! In the name of Allah be its course and its mooring. Lo! my Lord is Forgiving, Merciful.

source: وهي تجري بهم في موج كالجبال ونادى نوح ابنه وكان في معزل يا بني اركب معنا ولا تكن مع الكافرين
en: And it sailed with them amid waves like mountains, and Noah cried unto his son - and he was standing aloof - O my son! Come ride with us, and be not with the disbelievers.

source: قال سآوي إلى جبل يعصمني من الماء قال لا عاصم اليوم من أمر الله إلا من رحم وحال بينهما الموج فكان من المغرقين
en: He said: I shall betake me to some mountain that will save me from the water. (Noah) said: This day there is none that saveth from the commandment of Allah save him on whom He hath had mercy. And the wave came in between them, so he was among the drowned.

source: وقيل يا أرض ابلعي ماءك ويا سماء أقلعي وغيض الماء وقضي الأمر واستوت على الجودي وقيل بعدا للقوم الظالمين
en: And it was said: O earth! Swallow thy water and, O sky! be cleared of clouds! And the water was made to subside. And the commandment was fulfilled. And it (the ship) came to rest upon (the mount) Al-Judi and it was said: A far removal for wrongdoing folk!

source: ونادى نوح ربه فقال رب إن ابني من أهلي وإن وعدك الحق وأنت أحكم الحاكمين
en: And Noah cried unto his Lord and said: My Lord! Lo! my son is of my household! Surely Thy promise is the truth and Thou are the Most Just of Judges.

source: قال يا نوح إنه ليس من أهلك إنه عمل غير صالح فلا تسألن ما ليس لك به علم إني أعظك أن تكون من الجاهلين
en: He said: O Noah! Lo! he is not of thy household; lo! he is of evil conduct, so ask not of Me that whereof thou hast no knowledge. I admonish thee lest thou be among the ignorant.

source: قال رب إني أعوذ بك أن أسألك ما ليس لي به علم وإلا تغفر لي وترحمني أكن من الخاسرين
en: He said: My Lord! Lo! in Thee do I seek refuge (from the sin) that I should ask of Thee that whereof I have no knowledge. Unless Thou forgive me and have mercy on me I shall be among the lost.

source: قيل يا نوح اهبط بسلام منا وبركات عليك وعلى أمم ممن معك وأمم سنمتعهم ثم يمسهم منا عذاب أليم
en: It was said (unto him): O Noah! Go thou down (from the mountain) with peace from Us and blessings upon thee and some nations (that will spring) from those with thee. (There will be other) nations unto whom We shall give enjoyment a long while and then a painful doom from Us will overtake them.

source: تلك من أنباء الغيب نوحيها إليك ما كنت تعلمها أنت ولا قومك من قبل هذا فاصبر إن العاقبة للمتقين
en: This is of the tidings of the Unseen which We inspire in thee (Muhammad). Thou thyself knewest it not, nor did thy folk (know it) before this. Then have patience. Lo! the sequel is for those who ward off (evil).

source: وإلى عاد أخاهم هودا قال يا قوم اعبدوا الله ما لكم من إله غيره إن أنتم إلا مفترون
en: And unto (the tribe of) A'ad (We sent) their brother, Hud. He said: O my people! Serve Allah! Ye have no other Allah save Him. Lo! ye do but invent.

source: يا قوم لا أسألكم عليه أجرا إن أجري إلا على الذي فطرني أفلا تعقلون
en: O my people! I ask of you no reward for it. Lo! my reward is the concern only of Him Who made me. Have ye then no sense?

source: ويا قوم استغفروا ربكم ثم توبوا إليه يرسل السماء عليكم مدرارا ويزدكم قوة إلى قوتكم ولا تتولوا مجرمين
en: And, O my people! Ask forgiveness of your Lord, then turn unto Him repentant; He will cause the sky to rain abundance on you and will add unto you strength to your strength. Turn not away, guilty!

source: قالوا يا هود ما جئتنا ببينة وما نحن بتاركي آلهتنا عن قولك وما نحن لك بمؤمنين
en: They said: O Hud! Thou hast brought us no clear proof and we are not going to forsake our gods on thy (mere) saying, and we are not believers in thee.

source: إن نقول إلا اعتراك بعض آلهتنا بسوء قال إني أشهد الله واشهدوا أني بريء مما تشركون
en: We say naught save that one of our gods hath possessed thee in an evil way. He said: I call Allah to witness, and do ye (too) bear witness, that I am innocent of (all) that ye ascribe as partners (to Allah)

source: من دونه فكيدوني جميعا ثم لا تنظرون
en: Beside Him. So (try to) circumvent me, all of you, give me no respite.

source: إني توكلت على الله ربي وربكم ما من دابة إلا هو آخذ بناصيتها إن ربي على صراط مستقيم
en: Lo! I have put my trust in Allah, my Lord and your Lord. Not an animal but He doth grasp it by the forelock! Lo! my Lord is on a straight path.

source: فإن تولوا فقد أبلغتكم ما أرسلت به إليكم ويستخلف ربي قوما غيركم ولا تضرونه شيئا إن ربي على كل شيء حفيظ
en: And if ye turn away, still I have conveyed unto you that wherewith I was sent unto you, and my Lord will set in place of you a folk other than you. Ye cannot injure Him at all. Lo! my Lord is Guardian over all things.

source: ولما جاء أمرنا نجينا هودا والذين آمنوا معه برحمة منا ونجيناهم من عذاب غليظ
en: And when Our commandment came to pass We saved Hud and those who believed with him by a mercy from Us; We saved them from a harsh doom.

source: وتلك عاد جحدوا بآيات ربهم وعصوا رسله واتبعوا أمر كل جبار عنيد
en: And such were A'ad. They denied the revelations of their Lord and flouted His messengers and followed the command of every froward potentate.

source: وأتبعوا في هذه الدنيا لعنة ويوم القيامة ألا إن عادا كفروا ربهم ألا بعدا لعاد قوم هود
en: And a curse was made to follow them in the world and on the Day of Resurrection. Lo! A'ad disbelieved in their Lord. A far removal for A'ad, the folk of Hud!

source: وإلى ثمود أخاهم صالحا قال يا قوم اعبدوا الله ما لكم من إله غيره هو أنشأكم من الأرض واستعمركم فيها فاستغفروه ثم توبوا إليه إن ربي قريب مجيب
en: And unto (the tribe of) Thamud (We sent) their brother Salih. He said: O my people! Serve Allah, Ye have no other Allah save Him. He brought you forth from the earth and hath made you husband it. So ask forgiveness of Him and turn unto Him repentant. Lo! my Lord is Nigh, Responsive.

source: قالوا يا صالح قد كنت فينا مرجوا قبل هذا أتنهانا أن نعبد ما يعبد آباؤنا وإننا لفي شك مما تدعونا إليه مريب
en: They said: O Salih! Thou hast been among us hitherto as that wherein our hope was placed. Dost thou ask us not to worship what our fathers worshipped? Lo! we verily are in grave doubt concerning that to which thou callest us.

source: قال يا قوم أرأيتم إن كنت على بينة من ربي وآتاني منه رحمة فمن ينصرني من الله إن عصيته فما تزيدونني غير تخسير
en: He said: O my people! Bethink you: if I am (acting) on clear proof from my Lord and there hath come unto me a mercy from Him, who will save me from Allah if I disobey Him? Ye would add to me naught save perdition.

source: ويا قوم هذه ناقة الله لكم آية فذروها تأكل في أرض الله ولا تمسوها بسوء فيأخذكم عذاب قريب
en: O my people! This is the camel of Allah, a token unto you, so suffer her to feed in Allah's earth, and touch her not with harm lest a near torment seize you.

source: فعقروها فقال تمتعوا في داركم ثلاثة أيام ذلك وعد غير مكذوب
en: But they hamstrung her, and then he said: Enjoy life in your dwelling-place three days! This is a threat that will not be belied.

source: فلما جاء أمرنا نجينا صالحا والذين آمنوا معه برحمة منا ومن خزي يومئذ إن ربك هو القوي العزيز
en: So, when Our commandment came to pass, We saved Salih, and those who believed with him, by a mercy from Us, from the ignominy of that day. Lo, thy Lord! He is the Strong, the Mighty.

source: وأخذ الذين ظلموا الصيحة فأصبحوا في ديارهم جاثمين
en: And the (awful) Cry overtook those who did wrong, so that morning found them prostrate in their dwellings,

source: كأن لم يغنوا فيها ألا إن ثمود كفروا ربهم ألا بعدا لثمود
en: As though they had not dwelt there. Lo! Thamud disbelieved in their Lord. A far removal for Thamud!

source: ولقد جاءت رسلنا إبراهيم بالبشرى قالوا سلاما قال سلام فما لبث أن جاء بعجل حنيذ
en: And Our messengers cam unto Abraham with good news. They said: Peace! He answered: Peace! and delayed not to bring a roasted calf.

source: فلما رأى أيديهم لا تصل إليه نكرهم وأوجس منهم خيفة قالوا لا تخف إنا أرسلنا إلى قوم لوط
en: And when he saw their hands reached not to it, he mistrusted them and conceived a fear of them. They said: Fear not! Lo! we are sent unto the folk of Lot.

source: وامرأته قائمة فضحكت فبشرناها بإسحاق ومن وراء إسحاق يعقوب
en: And his wife, standing by laughed when We gave her good tidings (of the birth) of Isaac, and, after Isaac, of Jacob.

source: قالت يا ويلتى أألد وأنا عجوز وهذا بعلي شيخا إن هذا لشيء عجيب
en: She said: Oh woe is me! Shall I bear a child when I am an old woman, and this my husband is an old man? Lo! this is a strange thing!

source: قالوا أتعجبين من أمر الله رحمت الله وبركاته عليكم أهل البيت إنه حميد مجيد
en: They said: Wonderest thou at the commandment of Allah? The mercy of Allah and His blessings be upon you, O people of the house! Lo! He is Owner of Praise, Owner of Glory!

source: فلما ذهب عن إبراهيم الروع وجاءته البشرى يجادلنا في قوم لوط
en: And when the awe departed from Abraham, and the glad news reached him, he pleaded with Us on behalf of the folk of Lot.

source: إن إبراهيم لحليم أواه منيب
en: Lo! Abraham was mild, imploring, penitent.

source: يا إبراهيم أعرض عن هذا إنه قد جاء أمر ربك وإنهم آتيهم عذاب غير مردود
en: (It was said) O Abraham! Forsake this! Lo! thy Lord's commandment hath gone forth, and lo! there cometh unto them a doom which cannot be repelled.

source: ولما جاءت رسلنا لوطا سيء بهم وضاق بهم ذرعا وقال هذا يوم عصيب
en: And when Our messengers came unto Lot, he was distressed and knew not how to protect them. He said: This is a distressful day.

source: وجاءه قومه يهرعون إليه ومن قبل كانوا يعملون السيئات قال يا قوم هؤلاء بناتي هن أطهر لكم فاتقوا الله ولا تخزون في ضيفي أليس منكم رجل رشيد
en: And his people came unto him, running towards him - and before then they used to commit abominations - He said: O my people! Here are my daughters! They are purer for you. Beware of Allah, and degrade me not in (the person of) my guests. Is there not among you any upright man?

source: قالوا لقد علمت ما لنا في بناتك من حق وإنك لتعلم ما نريد
en: They said: Well thou knowest that we have no right to thy daughters, and well thou knowest what we want.

source: قال لو أن لي بكم قوة أو آوي إلى ركن شديد
en: He said: Would that I had strength to resist you or had some strong support (among you)!

source: قالوا يا لوط إنا رسل ربك لن يصلوا إليك فأسر بأهلك بقطع من الليل ولا يلتفت منكم أحد إلا امرأتك إنه مصيبها ما أصابهم إن موعدهم الصبح أليس الصبح بقريب
en: (The messengers) said: O Lot! Lo! we are messengers of thy Lord; they shall not reach thee. So travel with thy people in a part of the night, and let not one of you turn round - (all) save thy wife. Lo! that which smiteth them will smite her (also). Lo! their tryst is (for) the morning. Is not the morning nigh?

source: فلما جاء أمرنا جعلنا عاليها سافلها وأمطرنا عليها حجارة من سجيل منضود
en: So when Our commandment came to pass We overthrew (that township) and rained upon it stones of clay, one after another,

source: مسومة عند ربك وما هي من الظالمين ببعيد
en: Marked with fire in the providence of thy Lord (for the destruction of the wicked). And they are never far from the wrong-doers.

source: وإلى مدين أخاهم شعيبا قال يا قوم اعبدوا الله ما لكم من إله غيره ولا تنقصوا المكيال والميزان إني أراكم بخير وإني أخاف عليكم عذاب يوم محيط
en: And unto Midian (We sent) their brother Shu'eyb. He said: O my people! Serve Allah. Ye have no other Allah save Him! And give not short measure and short weight. Lo! I see you well-to-do, and lo! I fear for you the doom of a besetting Day.

source: ويا قوم أوفوا المكيال والميزان بالقسط ولا تبخسوا الناس أشياءهم ولا تعثوا في الأرض مفسدين
en: O my people! Give full measure and full weight in justice, and wrong not people in respect of their goods. And do not evil in the earth, causing corruption.

source: بقيت الله خير لكم إن كنتم مؤمنين وما أنا عليكم بحفيظ
en: That which Allah leaveth with you is better for you if ye are believers; and I am not a keeper over you.

source: قالوا يا شعيب أصلاتك تأمرك أن نترك ما يعبد آباؤنا أو أن نفعل في أموالنا ما نشاء إنك لأنت الحليم الرشيد
en: They said: O Shu'eyb! Doth thy way of prayer command thee that we should forsake that which our fathers (used to) worship, or that we (should leave off) doing what we will with our own property. Lo! thou art the mild, the guide to right behaviour.

source: قال يا قوم أرأيتم إن كنت على بينة من ربي ورزقني منه رزقا حسنا وما أريد أن أخالفكم إلى ما أنهاكم عنه إن أريد إلا الإصلاح ما استطعت وما توفيقي إلا بالله عليه توكلت وإليه أنيب
en: He said: O my people! Bethink you: if I am (acting) on a clear proof from my Lord and He sustaineth me with fair sustenance from Him (how can I concede aught to you)? I desire not to do behind your backs that which I ask you not to do. I desire naught save reform so far as I am able. My welfare is only in Allah. In Him I trust and unto Him I turn (repentant).

source: ويا قوم لا يجرمنكم شقاقي أن يصيبكم مثل ما أصاب قوم نوح أو قوم هود أو قوم صالح وما قوم لوط منكم ببعيد
en: And, O my people! Let not the schism with me cause you to sin so that there befall you that which befell the folk of Noah and the folk of Hud, and the folk of Salih; and the folk of Lot are not far off from you.

source: واستغفروا ربكم ثم توبوا إليه إن ربي رحيم ودود
en: Ask pardon of your Lord and then turn unto Him (repentant). Lo! my Lord is Merciful, Loving.

source: قالوا يا شعيب ما نفقه كثيرا مما تقول وإنا لنراك فينا ضعيفا ولولا رهطك لرجمناك وما أنت علينا بعزيز
en: They said: O Shu'eyb! We understand not much of that thou tellest, and lo! we do behold thee weak among us. But for thy family, we should have stoned thee, for thou art not strong against us.

source: قال يا قوم أرهطي أعز عليكم من الله واتخذتموه وراءكم ظهريا إن ربي بما تعملون محيط
en: He said: O my people! Is my family more to be honoured by you than Allah? and ye put Him behind you, neglected! Lo! my Lord surroundeth what ye do.

source: ويا قوم اعملوا على مكانتكم إني عامل سوف تعلمون من يأتيه عذاب يخزيه ومن هو كاذب وارتقبوا إني معكم رقيب
en: And, O my people! Act according to your power, lo! I (too) am acting. Ye will soon know on whom there cometh a doom that will abase him, and who it is that lieth. And watch! Lo! I am a watcher with you.

source: ولما جاء أمرنا نجينا شعيبا والذين آمنوا معه برحمة منا وأخذت الذين ظلموا الصيحة فأصبحوا في ديارهم جاثمين
en: And when Our commandment came to pass We saved Shu'eyb and those who believed with him by a mercy from Us; and the (Awful) Cry seized those who did injustice, and morning found them prostrate in their dwellings,

source: كأن لم يغنوا فيها ألا بعدا لمدين كما بعدت ثمود
en: As though they had not dwelt there. A far removal for Midian, even as Thamud had been removed afar!

source: ولقد أرسلنا موسى بآياتنا وسلطان مبين
en: And verily We sent Moses with Our revelations and a clear warrant

source: إلى فرعون وملئه فاتبعوا أمر فرعون وما أمر فرعون برشيد
en: Unto Pharaoh and his chiefs, but they did follow the command of Pharaoh, and the command of Pharaoh was no right guide.

source: يقدم قومه يوم القيامة فأوردهم النار وبئس الورد المورود
en: He will go before his people on the Day of Resurrection and will lead them to the Fire for watering-place. Ah, hapless is the watering-place (whither they are) led.

source: وأتبعوا في هذه لعنة ويوم القيامة بئس الرفد المرفود
en: A curse is made to follow them in the world and on the Day of Resurrection. Hapless is the gift (that will be) given (them).

source: ذلك من أنباء القرى نقصه عليك منها قائم وحصيد
en: That is (something) of the tidings of the townships (which were destroyed of old). We relate it unto thee (Muhammad). Some of them are standing and some (already) reaped.

source: وما ظلمناهم ولكن ظلموا أنفسهم فما أغنت عنهم آلهتهم التي يدعون من دون الله من شيء لما جاء أمر ربك وما زادوهم غير تتبيب
en: We wronged them not, but they did wrong themselves; and their gods on whom they call beside Allah availed them naught when came thy Lord's command; they added to them naught save ruin.

source: وكذلك أخذ ربك إذا أخذ القرى وهي ظالمة إن أخذه أليم شديد
en: Even thus is the grasp of thy Lord when He graspeth the townships while they are doing wrong. Lo! His grasp is painful, very strong.

source: إن في ذلك لآية لمن خاف عذاب الآخرة ذلك يوم مجموع له الناس وذلك يوم مشهود
en: Lo! herein verily there is a portent for those who fear the doom of the Hereafter. That is a day unto which mankind will be gathered, and that is a day that will be witnessed.

source: وما نؤخره إلا لأجل معدود
en: And We defer it only to a term already reckoned.

source: يوم يأت لا تكلم نفس إلا بإذنه فمنهم شقي وسعيد
en: On the day when it cometh no soul will speak except by His permission; some among them will be wretched, (others) glad.

source: فأما الذين شقوا ففي النار لهم فيها زفير وشهيق
en: As for those who will be wretched (on that day) they will be in the Fire; sighing and wailing will be their portion therein,

source: خالدين فيها ما دامت السماوات والأرض إلا ما شاء ربك إن ربك فعال لما يريد
en: Abiding there so long as the heavens and the earth endure save for that which thy Lord willeth. Lo! thy Lord is Doer of what He will.

source: وأما الذين سعدوا ففي الجنة خالدين فيها ما دامت السماوات والأرض إلا ما شاء ربك عطاء غير مجذوذ
en: And as for those who will be glad (that day) they will be in the Garden, abiding there so long as the heavens and the earth endure save for that which thy Lord willeth: a gift unfailing.

source: فلا تك في مرية مما يعبد هؤلاء ما يعبدون إلا كما يعبد آباؤهم من قبل وإنا لموفوهم نصيبهم غير منقوص
en: So be not thou in doubt concerning that which these (folk) worship. They worship only as their fathers worshipped aforetime. Lo! we shall pay them their whole due unabated.

source: ولقد آتينا موسى الكتاب فاختلف فيه ولولا كلمة سبقت من ربك لقضي بينهم وإنهم لفي شك منه مريب
en: And we verily gave unto Moses the Scripture, and there was strife thereupon; and had it not been for a Word that had already gone forth from thy Lord, the case would have been judged between them, and lo! they are in grave doubt concerning it.
